open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_cloud_runtime.c
 before_capture=camera_calls; before_image=image_calls; before_chat=chat_calls;
 before_tts=tts_calls; before_commit=commits;
 recognized_text="不要拍照看看";
 bkcloud_runtime_step(r,true,true,1);bkcloud_runtime_step(r,true,false,1);
 for(int i=0;i<1000 && bkcloud_runtime_busy(r);i++)
   {bkcloud_runtime_step(r,true,false,1);pause_ms();}
 assert(camera_calls==before_capture && image_calls==before_image &&
        chat_calls==before_chat+1 && tts_calls==before_tts+1 &&
        commits==before_commit+1);

 before_image=image_calls; before_chat=chat_calls; before_tts=tts_calls;
 before_commit=commits; recognized_text="看看眼前"; camera_error=-EIO;
 bkcloud_runtime_step(r,true,true,1);bkcloud_runtime_step(r,true,false,1);
 for(int i=0;i<1000 && bkcloud_runtime_busy(r);i++)
   {bkcloud_runtime_step(r,true,false,1);pause_ms();}
 assert(image_calls==before_image && chat_calls==before_chat &&
        tts_calls==before_tts && commits==before_commit);
 camera_error=0;

 before_image=image_calls; before_tts=tts_calls; before_commit=commits;
 recognized_text="拍照看看";
 __atomic_store_n(&camera_entered,false,__ATOMIC_RELEASE);
 __atomic_store_n(&camera_blocked,true,__ATOMIC_RELEASE);
 bkcloud_runtime_step(r,true,true,1);bkcloud_runtime_step(r,true,false,1);
 for(int i=0;i<1000 && !__atomic_load_n(&camera_entered,__ATOMIC_ACQUIRE);i++)pause_ms();
 assert(__atomic_load_n(&camera_entered,__ATOMIC_ACQUIRE));
 assert(bkcloud_runtime_cancel_drain(r)==-EAGAIN);
 __atomic_store_n(&camera_blocked,false,__ATOMIC_RELEASE);
 for(int i=0;i<1000 && bkcloud_runtime_busy(r);i++)
   {
     int drain = bkcloud_runtime_cancel_drain(r);
     assert(drain == 0 || drain == -EAGAIN);
     pause_ms();
   }
 assert(image_calls==before_image && tts_calls==before_tts && commits==before_commit);
 assert(bkcloud_runtime_clear(&r)==0 && r==NULL);
#endif
 /* Automatic capture begins through prefill rather than a synthesized PTT
  * level.  A neutral button step must leave that capture running. */
 assert(bkcloud_runtime_create(&r,record,n,&trust,&ptt,NULL)==0);
 assert(bkcloud_runtime_connect(r)==0);
 ready=0;
 for (int i = 0; i < 1000 && !ready; i++)
   { ready=bkcloud_runtime_ready(r); pause_ms(); }
 assert(ready==1);
 unsigned int prefill_reads = 0;
 int asr_before_auto = asr_calls;
 int commits_before_auto = commits;
 bkcloud_runtime_step(r, true, false, 1);
 assert(bkcloud_runtime_auto_begin(r, auto_prefill_read, &prefill_reads, 2,
                                   NULL, NULL) == 0);
 assert(prefill_reads == 2 && auto_prefill_calls == 2 &&
        ptt.worker_joinable && bkcloud_runtime_busy(r));
 bkcloud_runtime_step(r, true, false, 1);
 assert(ptt.worker_joinable && asr_calls == asr_before_auto);
 assert(bkcloud_runtime_auto_end(r) == 0);
 assert(bkcloud_runtime_auto_end(r) == -EPERM);
 for (int i = 0; i < 1000 && bkcloud_runtime_busy(r); i++)
   { bkcloud_runtime_step(r, true, false, 1); pause_ms(); }
 assert(asr_calls == asr_before_auto + 1 && commits == commits_before_auto + 1);
 /* Cancellation uses the ordinary stop/join cleanup even for auto capture. */
 assert(bkcloud_runtime_auto_begin(r, auto_prefill_read, &prefill_reads, 2,
                                   NULL, NULL) == 0);
 assert(bkcloud_runtime_cancel(r) == 0);
 bkcloud_runtime_step(r, true, false, 1);
 assert(!bkcloud_runtime_busy(r) && ptt.turn.state == BKVOICE_TURN_IDLE &&
        asr_calls == asr_before_auto + 1);
 /* A failed prefill can still leave the capture worker borrowing PCM. It is
  * fail-closed: end cannot upload it, and neutral steps retry cancel/join. */
 auto_down_prefill_error = -EIO;
 assert(bkcloud_runtime_auto_begin(r, auto_prefill_read, &prefill_reads, 2,
                                   NULL, NULL) == -EIO);
 assert(ptt.worker_joinable && bkcloud_runtime_busy(r));
 int asr_before_prefill_failure = asr_calls;
 assert(bkcloud_runtime_auto_end(r) == -ECANCELED);
 auto_cancel_leave_worker = true;
 bkcloud_runtime_step(r, true, false, 1);
 assert(ptt.worker_joinable && bkcloud_runtime_busy(r) &&
        asr_calls == asr_before_prefill_failure);
 auto_cancel_leave_worker = false;
 bkcloud_runtime_step(r, true, false, 1);
 assert(!bkcloud_runtime_busy(r) && ptt.turn.state == BKVOICE_TURN_IDLE &&
        asr_calls == asr_before_prefill_failure);
 auto_down_prefill_error = 0;
 /* A pending capture join leaves automatic state active; retrying end() after
  * the join completes launches exactly once. */
 assert(bkcloud_runtime_auto_begin(r, auto_prefill_read, &prefill_reads, 2,
                                   NULL, NULL) == 0);
 int asr_before_join_retry = asr_calls;
 auto_up_leave_worker = true;
 assert(bkcloud_runtime_auto_end(r) == -EAGAIN);
 assert(ptt.worker_joinable && bkcloud_runtime_busy(r));
 bkcloud_runtime_step(r, true, false, 1);
 assert(ptt.worker_joinable && asr_calls == asr_before_join_retry);
 auto_up_leave_worker = false;
 assert(bkcloud_runtime_auto_end(r) == 0);
 assert(bkcloud_runtime_auto_end(r) == -EPERM);
 for (int i = 0; i < 1000 && bkcloud_runtime_busy(r); i++)
   { bkcloud_runtime_step(r, true, false, 1); pause_ms(); }
 assert(asr_calls == asr_before_join_retry + 1);
 /* Link loss and a new input epoch cancel automatic capture before the
  * regular button-level path can release it. */
 int asr_before_link_cancel = asr_calls;
 assert(bkcloud_runtime_auto_begin(r, auto_prefill_read, &prefill_reads, 2,
                                   NULL, NULL) == 0);
 bkcloud_runtime_step(r, false, false, 1);
 assert(!bkcloud_runtime_busy(r) && ptt.turn.state == BKVOICE_TURN_IDLE &&
        asr_calls == asr_before_link_cancel);
 bkcloud_runtime_step(r, true, false, 1);
 assert(bkcloud_runtime_auto_begin(r, auto_prefill_read, &prefill_reads, 2,
                                   NULL, NULL) == 0);
 bkcloud_runtime_step(r, true, false, 2);
 assert(!bkcloud_runtime_busy(r) && ptt.turn.state == BKVOICE_TURN_IDLE &&
        asr_calls == asr_before_link_cancel);
 assert(bkcloud_runtime_clear(&r)==0 && r==NULL);
 puts("PASS: ASR/chat/TTS auth and timeout failures preserve history and allow the next turn");
 puts("PASS: DNS failure/retry/address refresh, simulated PTT, deferred history, playback timeout, join-before-clear");
 return 0;
}
